fio/log
rbd_image0: (g=0): rw=randrw, bs=(R) 4096B-4096B, (W) 4096B-4096B, (T) 4096B-4096B, ioengine=rbd, iodepth=64
rbd_image1: (g=0): rw=randrw, bs=(R) 4096B-4096B, (W) 4096B-4096B, (T) 4096B-4096B, ioengine=rbd, iodepth=64
fio-3.1
Starting 2 processes

rbd_image0: (groupid=0, jobs=2): err= 0: pid=67327: Mon Jul  2 17:55:10 2018
   read: IOPS=9306, BW=36.4MiB/s (38.1MB/s)(13.9MiB/382msec)
    slat (nsec): min=549, max=30610, avg=1683.85, stdev=2627.74
    clat (usec): min=441, max=53751, avg=8301.38, stdev=9010.20
     lat (usec): min=442, max=53752, avg=8303.06, stdev=9010.25
    clat percentiles (usec):
     |  1.00th=[ 1713],  5.00th=[ 2606], 10.00th=[ 3195], 20.00th=[ 3687],
     | 30.00th=[ 4015], 40.00th=[ 4883], 50.00th=[ 5538], 60.00th=[ 6521],
     | 70.00th=[ 7308], 80.00th=[ 9503], 90.00th=[14091], 95.00th=[37487],
     | 99.00th=[46400], 99.50th=[46400], 99.90th=[50070], 99.95th=[50070],
     | 99.99th=[53740]
  write: IOPS=4096, BW=16.0MiB/s (16.8MB/s)(6260KiB/382msec)
    slat (nsec): min=3507, max=66495, avg=9690.65, stdev=7521.09
    clat (usec): min=1023, max=49906, avg=8447.47, stdev=8929.16
     lat (usec): min=1034, max=49922, avg=8457.17, stdev=8929.64
    clat percentiles (usec):
     |  1.00th=[ 1778],  5.00th=[ 2638], 10.00th=[ 3228], 20.00th=[ 3785],
     | 30.00th=[ 4359], 40.00th=[ 5145], 50.00th=[ 5669], 60.00th=[ 6718],
     | 70.00th=[ 7570], 80.00th=[ 9503], 90.00th=[14222], 95.00th=[34341],
     | 99.00th=[45351], 99.50th=[46400], 99.90th=[50070], 99.95th=[50070],
     | 99.99th=[50070]
  lat (usec)   : 500=0.08%
  lat (msec)   : 2=1.68%, 4=26.70%, 10=53.28%, 20=11.86%, 50=6.35%
  lat (msec)   : 100=0.06%
  cpu          : usr=2.49%, sys=1.47%, ctx=452, majf=0, minf=1655
  IO depths    : 1=0.8%, 2=1.6%, 4=3.5%, 8=8.3%, 16=22.4%, 32=60.6%, >=64=2.9%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=98.0%, 8=0.1%, 16=0.1%, 32=0.3%, 64=1.5%, >=64=0.0%
     issued rwt: total=3555,1565,0, short=0,0,0, dropped=0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=64

Run status group 0 (all jobs):
   READ: bw=36.4MiB/s (38.1MB/s), 36.4MiB/s-36.4MiB/s (38.1MB/s-38.1MB/s), io=13.9MiB (14.6MB), run=382-382msec
  WRITE: bw=16.0MiB/s (16.8MB/s), 16.0MiB/s-16.0MiB/s (16.8MB/s-16.8MB/s), io=6260KiB (6410kB), run=382-382msec

Disk stats (read/write):
    dm-0: ios=0/6, merge=0/0, ticks=0/35, in_queue=35, util=8.58%, aggrios=0/8, aggrmerge=0/0, aggrticks=0/35, aggrin_queue=35, aggrutil=6.97%
  sdc: ios=0/8, merge=0/0, ticks=0/35, in_queue=35, util=6.97%